examples/coupled/fcc/fcc_fixedParticles/openfoam/0/Ub
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	 2.0;
	format	 ascii;
	class	 volVectorField;
	object	 Ub;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions 	 [0 1 -2 0 0 0 0];

internalField 	 uniform (0 0.01 0); 

boundaryField
{
	top
	{
		type zeroGradient;
	}
	
	bottom
	{
		type fixedValue;
		value uniform (0 0.01 0);
	}
	
	streamwiseIn
	{
		type cyclic;
		neighbourPatch streamwiseOut;
	}
	
	streamwiseOut
	{
		type cyclic;
		neighbourPatch streamwiseIn;
	}
	
	front
	{
		type cyclic;
		neighbourPatch back;
	}
	
	back
	{
		type cyclic;
		neighbourPatch front;
	}
	
}
// ************************************************************************* //
